# Laboratorio 2 - Pandas

In [8]:
#Pandas trabaja con datos proporcionados de un origen.
#Utiliza estructuras de datos (series y dataframe)
#Pandas, permite leer un conjunto de datos.
#Ej. puede que nos contraten para analizar datos.
#Pandas, se usa para el procesamiento de informacion. Cargado de data.
#Pandas ya viene instalado en anaconda.
#Maneja estructura del tipo series.

In [89]:
#import pandas as pd
#import numpy as np
import pandas as pd
import numpy as np

In [90]:
#La estructura de datos del tipo serie necesita dos parametros: datos y etiquetas
#etiquetas=['a','b','c']
#datos=[1,2,3]
#pd.Series(data=datos,index=etiquetas)

etiquetas=['a','b','c']
datos=[1,2,3]
pd.Series(datos, etiquetas)

a    1
b    2
c    3
dtype: int64

In [92]:
#Generar datos a partir de series
#array=np.arange(5,8)
#pd.Series(array)

array=np.arange(5,8)
pd.Series(array)

0    5
1    6
2    7
dtype: int32

In [96]:
#array=np.arange(5,8)
#etiqueta=['venta_1','venta_2','venta_3']
#pd.Series(array, etiqueta)

array=np.arange(5,8)
etiqueta=['venta_1','venta_2','venta_3']
pd.Series(array, etiqueta) #(datos, etiquetas)

venta_1    5
venta_2    6
venta_3    7
dtype: int32

In [103]:
#serie1=pd.Series([1,2,3],['venta1','venta2','venta3'])
serie1=pd.Series([2,4,8],['venta1','venta2','venta3'])

In [104]:
serie1

venta1    2
venta2    4
venta3    8
dtype: int64

In [105]:
#Obtener la 'venta2'
#serie1['venta2']
serie1['venta3']

8

In [106]:
serie1[2]

8

In [107]:
serie2=pd.Series([4,5,6],['venta1','venta2','venta3'])

In [108]:
#Sumar dos series
serie_suma= serie1+serie2
serie_suma

venta1     6
venta2     9
venta3    14
dtype: int64

In [111]:
#series=pd.Series(np.random.randn(20000))
series=pd.Series(np.random.rand(100))

In [112]:
series.head()

0    0.019243
1    0.284496
2    0.771380
3    0.518503
4    0.412578
dtype: float64

In [113]:
series.tail()

95    0.820212
96    0.552202
97    0.854430
98    0.297875
99    0.141575
dtype: float64

## DataFrame

In [46]:
#Es una estructura de datos tabular que se compone de columnas y filas ordenadas para que se realizen 
#operaciones de manera sencilla.

In [115]:
#filas=['venta1','venta2','venta3']
#columnas=['ZonaA','ZonaB','ZonaC']
#datos=[[1,2,3],[4,5,6],[7,8,9]]
#dataFrame=pd.DataFrame(datos, filas,columnas)

filas=['venta1','venta2','venta3']
columnas=['zonaA','zonaB','zonaC']
datos=[[1,2,3],[4,5,6],[7,8,9]]
dataFrame=pd.DataFrame(datos,filas,columnas)

In [116]:
dataFrame

        zonaA  zonaB  zonaC
venta1      1      2      3
venta2      4      5      6
venta3      7      8      9

In [117]:
#sacar la fila 'venta1'
#dataFrame.loc['venta1']
dataFrame.loc['venta2']

zonaA    4
zonaB    5
zonaC    6
Name: venta2, dtype: int64

In [124]:
#dataFrame.loc[['venta1','venta2']]
dataFrame.loc[['venta1','venta2']]

        zonaA  zonaB  zonaC
venta1      1      2      3
venta2      4      5      6

In [126]:
#Seleccinar dos columnas
#dataFrame[['ZonaA','ZonaC']]
dataFrame[['zonaA','zonaB']]

        zonaA  zonaB
venta1      1      2
venta2      4      5
venta3      7      8

In [130]:
#Obtner un dato cruzado
#dataFrame.loc['venta1']['ZonaA']
#dataFrame.loc['venta1']['zonaA']
dataFrame.loc['venta1','zonaA']

1

In [131]:
#Adicionar una columna
#dataFrame['TodasLasZonas']=dataFrame['ZonaA']+dataFrame['ZonaB']+dataFrame['ZonaC']
dataFrame['total']=dataFrame['zonaA']+dataFrame['zonaB']+dataFrame['zonaC']

In [132]:
dataFrame

        zonaA  zonaB  zonaC  total
venta1      1      2      3      6
venta2      4      5      6     15
venta3      7      8      9     24

In [134]:
#Eliminar una columna temporalmente
#dataFrame.drop('TodasLasZonas', axis=1) #axis=1 elimina columnas; axis=0 elimina filas
dataFrame.drop('total', axis=1)

        zonaA  zonaB  zonaC
venta1      1      2      3
venta2      4      5      6
venta3      7      8      9

In [136]:
#Eliminar una columna definitivamente
#dataFrame.drop('TodasLasZonas', axis=1, inplace=True)
dataFrame.drop('total',axis=1, inplace=True)

In [137]:
dataFrame

        zonaA  zonaB  zonaC
venta1      1      2      3
venta2      4      5      6
venta3      7      8      9

In [139]:
#eliminar una fila temporalmente
#dataFrame.drop("venta1")
dataFrame.drop('venta1')

        zonaA  zonaB  zonaC
venta2      4      5      6
venta3      7      8      9

In [141]:
#dataFrame.drop("venta2", inplace=True)
dataFrame.drop('venta1', inplace=True)

In [142]:
dataFrame

        zonaA  zonaB  zonaC
venta2      4      5      6
venta3      7      8      9

In [145]:
condicion=dataFrame>=8
dataFrame[condicion]

        zonaA  zonaB  zonaC
venta2    NaN    NaN    NaN
venta3    NaN    8.0    9.0

In [143]:
#Permite ver la forma del dataFrame
dataFrame.shape

(2, 3)

In [77]:
filas=['venta1','venta2','venta3']
columnas=['ZonaA','ZonaB','ZonaC']
datos=[[120,250,347],[450,56,689],[75,80,993]]

In [79]:
dataFrame=pd.DataFrame(datos, filas, columnas)
dataFrame

        ZonaA  ZonaB  ZonaC
venta1    120    250    347
venta2    450     56    689
venta3     75     80    993

In [82]:
#De todos los datos, sacar los numeros mayores a 200
condicion = dataFrame > 200
dataFrame[condicion]

        ZonaA  ZonaB  ZonaC
venta1    NaN  250.0    347
venta2  450.0    NaN    689
venta3    NaN    NaN    993

In [87]:
#A la tecnica de sacar datos de la pagina web se llama webscraping
#En algunos casos de va a sacar informacion de base de datos, excel, web, etc. para luego manipular.